const observer = new IntersectionObserver((entries) => {
    entries.forEach((entry) => {
        if (entry.isIntersecting) {
            entry.target.classList.add(`show`);
            if (entry.target.classList.contains('child2') && document.body.classList.contains('rtlDir')) {
                entry.target.classList.add('moveInLeft')
            } else if (entry.target.classList.contains('child2') && !document.body.classList.contains('rtlDir')) {
                entry.target.classList.add('moveInRight');
            }
            else if (entry.target.classList.contains('child1') && document.body.classList.contains('rtlDir')) {
                entry.target.classList.add('moveInRight');
            } else if (entry.target.classList.contains('child1') && !document.body.classList.contains('rtlDir')) {
                entry.target.classList.add('moveInLeft');
            } else if (entry.target.classList.contains('child3')) {
                entry.target.classList.add('moveInBottom');
            } else if (entry.target.classList.contains('child4')) {
                entry.target.classList.add('moveInTop');
            }
            else if (entry.target.classList.contains('heading-animation')) {
                var textWrapper = document.querySelector('.heading-animation');
                textWrapper.innerHTML = textWrapper.textContent.replace(/\S/g, "<span class='letter'>$&</span>");

                anime.timeline({ loop: false })
                    .add({
                        targets: '.heading-animation .letter',
                        translateX: [40, 0],
                        translateZ: 0,
                        opacity: [0, 1],
                        easing: "easeOutExpo",
                        duration: 400,
                        delay: (el, i) => 500 + 70 * i
                    })
            } else if (entry.target.classList.contains('video')) {
                console.log('asasdad')
                entry.target.play();
            }
        }
    })
})



const ar_lang = document.getElementById('ar_lang');
const en_lang = document.getElementById('en_lang');

if (ar_lang) {
    ar_lang.addEventListener('click', () => {
        location.hash = 'ar';
        location.reload();
        sessionStorage.setItem('lang', 'ar');
        document.documentElement.setAttribute('lang', 'ar')
    })
}
if (en_lang) {
    en_lang.addEventListener('click', () => {
        location.hash = 'en';
        location.reload();
        sessionStorage.setItem('lang', 'en');
        document.documentElement.setAttribute('lang', 'en')
    })
}

// Define the language reload anchors
var language = {
    eng: {
        welcome: "THE COUNCIL OF ARAB AND AFRICAN LITTORAL STATES OF THE RED SEA AND THE GULF OF ADEN"
    },
    ar: {
        header: {
            home: "الرئيسية",
            members: "الأعضاء",
            aboutUs: "عنا",
            services: "الخدمات",
            contactUs: "تواصل معنا",
            focus: 'التركيز',
            collaboration: 'التعاون',
        },
        mainHeading: {
            home: "مجلس الدول العربية والأفريقية القانونيين للبحر الأحمر وخليج عدن",
            members: "من هم اعضاء منظمة البحر الأحمر وخليج عدن الإقليمية ؟",
            aboutUs: "من نحن ؟",
            collaboration: "التعاون في المستقبل",
            focus: "اعضاء منظمة البحر الأحمر وخليج عدن الإقليمية.",
            contactUs: "ابق على اتصال معنا!",
        },
        homePage: {
            authorityDiv: {
                authorityTitle: "منظمة البحر الأحمر وخليج عدن",
                authorityBrief: `تأسست منظمة البحر الأحمر وخليج عدن الإقليمية في يناير 2020 لتحسين العلاقات بين دولها من خلال التركيز على مشاريع تعزز التعاون والوحدة. تتكون المنظمة من جميع الدول الأعضاء التي تحد البحر الأحمر أو خليج عدن.
يتألف مجلس الإدارة من الدول الأعضاء الثمانية المؤسسة للمنظمة وهي السعودية ومصر والأردن واليمن والسودان والصومال وإريتريا وجيبوتي.
تقع مقر الأمانة العامة في الرياض بالمملكة العربية السعودية. يتألف المجلس من المجلس الأعلى والمجلس الوزاري والأمانة العامة ويتم عقد الاجتماعات من خلال رئاسة دوارة.
`,
            },
            mapTitle: "ها هي منظمة البحر الأحمر وخليج عدن",
            collaborationTitle: "التعاون",
            collaborationDiv: {
                title: "الهدف الرئيسي من منظمة البحر الأحمر وخليج عدن",
                brief: `هو تعزيز العلاقات بين الدول الأعضاء من خلال التركيز على المجالات والمبادرات الرئيسية التي ستزيد من التعاون والتعاون في جميع المجالات. يهدف المجلس إلى وضع جداول أعمال متماسكة، والعمل نحو أهداف مشتركة، وتحقيق النمو المتبادل في جميع أنحاء المنظمة.
لن يعزز مجلس منظمة البحر الأحمر وخليج عدن التعاون من خلال مجالات تركيزه الرئيسية فحسب، بل سيعزز أيضًا النمو والتنمية بين أعضائه. يمكن تحقيق ذلك من خلال اجتماعات المجلس المنتظمة وتحديثات التقدم، والمبادرات المتبادلة التي تعزز التعاون، والحفاظ على حوار قوي بين الممثلين الأعضاء، والسياسات التي تفيد جميع الأعضاء بشكل متبادل.
`,
            },
            goverance: "الحُكم",
            goveranceDiv: {
                supremeTitle: "المجلس الأعلى",
                ministerialTitle: "المجلس الوزاري",
                generalTitle: "الأمانة العامة",
                brief: "تعمل RSGA بموجب نموذج حوكمة بخمس طبقات ، وتعمل RSGA وفقًا لنموذج حوكمة من خمس طبقات.",
            },
        },
        memberPage: {
            memberTitle: "الأعضاء",
            aboutState: "عن الدولة",
            countries: {
                egypt: {
                    name: "مصر",
                    shortBrief: "مصر، المعروفة رسمياً بجمهورية مصر العربية، هي دولة ساحرة للغاية تتفاخر بوفرة من التاريخ والثقافة والمأكولات والديانة والجغرافيا المتنوعة.",
                    brief: `مصر هي دولة مذهلة تتميز بغناها بالتاريخ والثقافة والمأكولات والدين والجغرافيا المتنوعة. مع خصائصها الفريدة ، تقدم مصر شيئًا خاصًا لكل زائر لديه الفرصة لتجربة هذا المكان الرائع.
                    التاريخ المصري لا يقارن بأي بلد آخر ويعتبر واحدًا من أعظم ميراث حضارة الإنسان. ومع ذلك ، مصر أكثر بكثير من مجرد أهراماتها القديمة والمعالم التي تعود إلى آلاف السنين. إنها دولة حيّة ومليئة بالحياة ، وبلا شك مكان يجب على كل شخص زيارته مرة واحدة على الأقل في حياته.
                    تقع مصر في خليج العقبة ، ولها سواحل على البحر الأبيض المتوسط والبحر الأحمر ، ويجري نهر النيل عبر كامل البلاد. تتشارك مصر الحدود مع ليبيا وقطاع غزة والسودان وفلسطين. الصحراء الغربية ، التي تشكل حوالي ثلثي مساحة الأرض في مصر ، هي جزء من صحراء الصحراء وتقع على الجانب الغربي من نهر النيل.
                    `
                },
                saudi: {
                    name: "السعودية",
                    shortBrief: "المملكة العربية السعودية هي مملكة تقع في الشرق الأوسط، وتمتد عبر معظم شمال ووسط شبه الجزيرة العربية، وتتميز بكونها دولة قليلة السكان.",
                    brief: `المملكة العربية السعودية هي مملكة غير مكتظة بالسكان تقع في الشرق الأوسط، تمتد عبر معظم شبه الجزيرة العربية الشمالية والوسطى. على الرغم من صغر سنها كدولة، فإن المملكة العربية السعودية ترث تاريخاً غنياً. إقليم الحجاز الواقع على طول البحر الأحمر في الجبال الغربية هو مهد الإسلام وموطن أقدس مدن الدين، مكة المكرمة والمدينة المنورة. كما كان إقليم النجد الذي يقع في الجزء الوسطى الجغرافي، المعروف بـ "المرتفعات" حتى وقت قريب، مأهولاً بالقبائل البدوية. وفي نفس الوقت، على طول الخليج الفارسي إلى الشرق، تقع حقول النفط الوفيرة التي جعلت المملكة العربية السعودية مرادفاً لثروة البترول منذ الستينيات. وتتمثل هذه العناصر الثلاثة - الدين والحضارة والنفط - في هوية المملكة العربية السعودية وتاريخها الفريد.`
                },
                yemen: {
                    name: "اليمن",
                    shortBrief: "اليمن هي دولة تقع في الزاوية الجنوبية الغربية من شبه الجزيرة العربية. إنها منطقة جبلية وقاحلة بشكل عام، ولكن هناك مناطق واسعة تتلقى كميات كافية من الأمطار لجعل الزراعة ناجحة.",
                    brief: `اليمن هي دولة تقع في الزاوية الجنوبية الغربية من شبه الجزيرة العربية. تتميز بمعظمها بالجبال والجفاف، ولكن هناك مناطق واسعة تتمتع بكميات كافية من الأمطار لجعل الزراعة ناجحة. تأثر التاريخ والثقافة والاقتصاد والسكان في اليمن بموقعها الاستراتيجي عند المدخل الجنوبي للبحر الأحمر. لقد كانت مفترقًا للطرق التجارية والاتصالات القديمة والحديثة. في الماضي، كانت اليمن تسيطر على إمدادات السلع المهمة مثل اللبان والمر، وتهيمن على تجارة سلع قيمة أخرى مثل التوابل والعطور من آسيا. وبسبب خصوبتها وازدهارها التجاري، كانت اليمن موطنًا لعدد من الممالك القديمة وكانت معروفة باسم "أرابيا فيلكس" للرومان القدماء لتمييزها عن المناطق الواسعة والقاسية من "أرابيا ديزيرتا".`
                },
                jordan: {
                    name: "الأردن",
                    shortBrief: "الأردن هي دولة شابة تقع على أرض قديمة كانت موطنًا للعديد من الحضارات على مر التاريخ.",
                    brief: `الأردن هي دولة شابة تقع على أرض قديمة كانت موطنًا للعديد من الحضارات عبر التاريخ. تفصلها حدودها عن فلسطين القديمة بنهر الأردن، وقد لعبت المنطقة دورًا بارزًا في التاريخ الكتابي. وتضم الأردن العديد من الممالك الكتابية القديمة مثل مؤاب وجلعاد وإدوم، بالإضافة إلى المدينة الحجرية الشهيرة الوردية اللون والتي كانت عاصمة مملكة النبطيين ومقاطعة رومانية تدعى "أرابيا بيترايا". ووصفت المسافرة البريطانية جيرترود بيل بيترا بأنها "مثل مدينة خيالية، وردية ورائعة".`
                },
                djibouti: {
                    name: "جيبوتي",
                    shortBrief: "جيبوتي هي دولة صغيرة ولكنها ذات أهمية استراتيجية تقع على الساحل الشمالي الشرقي لقرن أفريقيا. تقع على مضيق باب المندب، الذي يفصل بحر البحر الأحمر عن خليج عدن.",
                    brief: "جيبوتي هي دولة صغيرة ولكنها ذات أهمية استراتيجية تقع على الساحل الشمالي الشرقي لقرن أفريقيا. وهي تقع على مضيق باب المندب الذي يفصل البحر الأحمر عن خليج عدن. كانت تعرف سابقاً باسم الصومال الفرنسي والإقليم الفرنسي للعفار والعيسى قبل استقلالها عن فرنسا عام 1977 واعتماد اسم جيبوتي. العاصمة، مدينة جيبوتي، مبنية على شعاب مرجانية تمتد إلى المدخل الجنوبي للخليج. وتشمل المدن الرئيسية الأخرى أوبوك، تاجورا، علي صبيح، أرتا، وديخيل. على الرغم من صغر حجمها، فإن جيبوتي لها أهمية جيوسياسية كبيرة، حيث إنها تضم ميناء عميق حديث يخدم حركة المرور بين المحيط الهندي والبحر الأحمر، وقاعدة بحرية فرنسية. بالإضافة إلى ذلك، فإن مدينة جيبوتي هي نقطة نهاية الخط الحديدي الوحيد الذي يخدم أديس أبابا، عاصمة إثيوبيا المجاورة."
                },
                eriteria: {
                    name: "إيرتيريا",
                    shortBrief: `إريتريا هي دولة تقع على قرن أفريقيا ولها موقع ساحلي على البحر الأحمر. يعكس اسمها أهمية تاريخها وثقافتها، حيث أن "Mare Erythraeum" هو التعبير اللاتيني لـ "البحر الأحمر".`,
                    brief: `إريتريا هي دولة تقع على قرن أفريقيا وتحظى بوجود ساحلي على البحر الأحمر. يعكس اسمها أهمية تاريخها وثقافتها، حيث يعني Mare Erythraeum باللاتينية "البحر الأحمر". توفر موانئ إريتريا الوصول إلى الذهب والقهوة والعبيد التي يتم بيعها من قبل التجار في الهضاب الإثيوبية إلى الجنوب. في النصف الثاني من القرن العشرين، اضطر الإريتريون إلى تحرير أنفسهم من الحكم الإثيوبي لإنشاء دولتهم الخاصة. بعد حرب استقلال استمرت لمدة تقرب من ثلاثة عقود، أصبحت إريتريا دولة مستقلة في عام 1993. على الرغم من أن الإريتريين قاموا ببناء وعي وطني مشترك خلال النضال من أجل الاستقلال، فإنهم يواجهون الآن مهمة التغلب على الاختلافات العرقية والدينية لتحسين فقر البلاد الذي تفاقم بسبب سنوات الجفاف والإهمال والحرب. وعاصمة إريتريا وأكبر مدينة فيها هي أسمرة (أسمرا) `
                },
                somalia: {
                    name: "الصومال",
                    shortBrief: "الصومال يقع في الجزء الأقصى الشرقي من أفريقيا، ويحتل موقعا استراتيجيا بين إفريقيا جنوب الصحراء الكبرى والجزيرة العربية وجنوب غرب آسيا.",
                    brief: `الصومال تقع في الجزء الأقصى الشرقي من أفريقيا، وتحتل موقعاً استراتيجياً بين جنوب الصحراء الافريقية والجزيرة العربية وجنوب غرب آسيا. وتمتد البلاد من جنوب خط الاستواء إلى خليج عدن، وتتميز بجغرافية قاسية من المناخ الجاف والحار والسافانا والمناطق الشبه صحراوية. وتقع العاصمة مقديشو على المحيط الهندي شمال خط الاستواء.

                    الصومال بلد يعيش سكانه فيها بطريقة تتطلب استراتيجيات اقتصادية محفوفة بالصعوبات بسبب بيئتها القاسية. وتتميز معظم البلاد بالأرض المسطحة بشدة، ولا توجد حواجز طبيعية كثيرة لتقييد حركة الرحل وماشيتهم، باستثناء منطقة جبلية ساحلية في الشمال وعدة واديه نهرية. ويعتنق الصوماليون الإسلام كدين ويتبعون نظاماً عشائرياً، ونحو ثلثيهم يعيشون بطريقة حياة متحركة يتبعون الرعي الرحلي أو الزراعة الرحوي
                    `
                },
                sudan: {
                    name: "السودان",
                    shortBrief: "السودان هي دولة تقع في تقاطع جنوب الصحراء الكبرى في إفريقيا والشرق الأوسط، وتمتد عبر البحر الأحمر.",
                    brief: `السودان هي دولة تقع عند تقاطع أفريقيا جنوب الصحراء والشرق الأوسط، وتمتد عبر البحر الأحمر. يحدها سبع دول، بما في ذلك ليبيا ومصر في الشمال، تشاد في الغرب، جمهورية أفريقيا الوسطى في الجنوب الغربي، جنوب السودان في الجنوب، إثيوبيا في الجنوب الشرقي، وإريتريا في الشرق. الخرطوم، عاصمة السودان، هي المكان الذي تلتقي فيه نهرا النيل الأبيض والنيل الأزرق ويتدفقان ليصبحا نهر النيل الذي يتدفق إلى البحر الأبيض المتوسط عبر مصر. يوجد في السودان حزام صحراوي مع الصحراء في الشمال البعيد، وأراض خصبة في وادي النيل، والجزيرة، بالإضافة إلى مناطق الزراعة وتربية الماشية في باقي أنحاء البلاد من دارفور إلى كسلا عبر ولايات النيل الأزرق وكردفان. على الرغم من أن السودان يتميز بكثرة موارده المائية، مثل نهر النيل الذي يعبر البلاد من الجنوب إلى الشمال، إلا أنه يتميز بانتشاره القليل في السكان. تحدها البلاد الأخرى التي تحيط بها على الحدود الدولية هي مصر وإريتريا وإثيوبيا وجنوب السودان وجمهورية أفريقيا الوسطى وتشاد وليبيا.`
                },
            },
            coreObjectice: {
                title: "الأهداف الأساسية",
                li1: "رفع مستوى التعاون والتفاهم والتنسيق في المواقف السياسية بين دول العضوية في المجلس من أجل خدمة مصالحهم في المنتديات الإقليمية والدولية.",
                li2: "تعميق العلاقات بين الدول الأعضاء لتجنب أي خلافات أو نزاعات بينهم.",
                li3: "تعزيز التعاون بين دول العضوية في مجالات التكنولوجيا والبحث العلمي والإعلام والثقافة والسياحة والطاقة والصناعة والتعدين والزراعة وموارد المياه والحيوانات الحية.",
                li4: "تعزيز التعاون والتنسيق بين موانئ الدول الأعضاء والتجارة العابرة وتشجيع إبرام اتفاقيات التوأمة بينها.",
            },
        },
        aboutUs: {
            whoWeAre: "من نحن",
            brief: `يحتوي البحر الأحمر وخليج عدن (RGSA) على ثماني دول أعضاء مؤسسة: المملكة العربية السعودية ومصر والأردن واليمن والسودان والصومال وإريتريا وجيبوتي.
            يقع مقر الأمانة العامة في الرياض، المملكة العربية السعودية.
            ينعقد المجلس من خلال رئاسة دورية ويتألف من ثلاث وكالات رئيسية: المجلس الأعلى والمجلس الوزاري والأمانة العامة.
            جميع الدول الأعضاء المتاخمة للبحر الأحمر أو خليج عدن هي جزء من المنظمة الإقليمية المعروفة باسم البحر الأحمر وخليج عدن، والتي تأسست في يناير 2020 لتحسين العلاقات بين أعضائها من خلال التركيز على المشاريع التي من شأنها تعزيز التعاون والوحدة.
            `,
            focus: "التركيز",
            environment: "البيئة",
            economicDevelopment: "التنمية الاقتصادية",
            scienceTechnology: "العلم والتكنولوجيا",
            trade: "التجارة",
            politicalStance: "السياسة",
            security: "الأمن",
            maritime: "البحرية",
            naturalResources: "الموارد الطبيعية",
            rsga: "منظمة البحر الأحمر وخليج عدن",
            rsgaBrief: `تأسست منظمة البحر الأحمر وخليج عدن الإقليمية في يناير 2020 لتحسين العلاقات بين دولها من خلال التركيز على مشاريع تعزز التعاون والوحدة. تتكون المنظمة من جميع الدول الأعضاء التي تحد البحر الأحمر أو خليج عدن.
            يتألف مجلس الإدارة من الدول الأعضاء الثمانية المؤسسة للمنظمة وهي السعودية ومصر والأردن واليمن والسودان والصومال وإريتريا وجيبوتي.
            تقع مقر الأمانة العامة في الرياض بالمملكة العربية السعودية. يتألف المجلس من المجلس الأعلى والمجلس الوزاري والأمانة العامة ويتم عقد الاجتماعات من خلال رئاسة دوارة.
            `
        },
        contactUs: {
            haveQuestion: "هل لديك سؤال ؟ تواصل معك للحصول على إجابتك.",
            fillUp: "إملأ الطلب أدناه وفريقنا سيرد عليك خلال 24 ساعة.",
            firstName: "الإسم الأول",
            lastName: "الإسم الأخير",
            email: "الإيميل",
            message: "أكتب الرسالة",
            submit: "إرسال"
        },
        collaboration: {
            relation: "العلاقات بين الأعضاء",
            partner: "الشراكات",
            cooperation: `التعاون بين الأعضاء`,
            brief1: `تشير العلاقات إلى الروابط بين أعضاء المجموعة أو الشبكة الاجتماعية داخل المجموعة. الأعضاء في مجموعة ما مرتبطون ببعضهم البعض على مستويات متفاوتة.

            يهدف مجلس منظمة البحر الأحمر وخليج عدن إلى تعزيز العلاقات بين أعضائه من خلال مجالات التركيز والمبادرات التي ستزيد من التعاون والتعاون في جميع المجالات بين الدول الأعضاء، وخلق أجندات متماسكة، والعمل نحو أهداف مشتركة، وتعزيز النمو المتبادل في جميع أنحاء المجلس.
            
            لن يؤدي وجود مجلس منظمة البحر الأحمر وخليج عدن إلى زيادة التعاون من خلال مجالات تركيزه الرئيسية فحسب، بل سيحفز أيضًا النمو بين الأعضاء. يمكن تحقيق ذلك من خلال اجتماعات المجلس المنتظمة وتحديثات التقدم، والمبادرات المتبادلة التي تعزز التعاون، والحفاظ على حوار قوي بين الممثلين الأعضاء، والسياسات التي تفيد جميع الأعضاء بشكل متبادل.
            
            التعاون أمر بالغ الأهمية للمجلس، وبالتالي نحن نقدر الشراكات مع الكتل والمنظمات من جميع أنحاء العالم. إن المجتمع الدولي التعاوني يسمح للعالم بأسره بالتطور والتعلم والازدهار. سيعمل مجلس منظمة البحر الأحمر وخليج عدن مع المنظمات والتكتلات واللجان الإقليمية والدولية من جميع أنحاء العالم.
            
            
            ويكون المجلس الأعلى، الذي يتألف من ملوك ورؤساء الدول الأعضاء في المجلس، أعلى سلطة في المجلس. ويتولى رئاسة المجلس الأعلى بالتناوب لكل ولاية وفقا للترتيب الأبجدي لأسماء الدول الأعضاء. وكاستثناء، يرأس البلد المضيف المجلس لفترة الولاية الأولى. يجتمع المجلس الأعلى بانتظام مرة في السنة ويجوز له عقد اجتماعات استثنائية عند الاقتضاء. وتكون الجلسات صحيحة إذا حضرها ثلثا أعضاء المجلس.
            `,
            brief2: `تشير العلاقات بين الأعضاء إلى الروابط بين أعضاء المجموعة، أو الشبكة الاجتماعية داخل المجموعة. يرتبط أعضاء المجموعة ببعضهم البعض على مستويات متفاوتة. يهدف مجلس منظمة البحر الأحمر وخليج عدن إلى تعزيز العلاقات بين أعضائه من خلال زيادة التعاون في جميع المجالات بين الدول الأعضاء، وخلق أجندات متماسكة، والعمل على تحقيق الأهداف المشتركة، وتعزيز النمو المتبادل في جميع أنحاء المجلس.

            لتحقيق ذلك، سيعقد مجلس منظمة البحر الأحمر وخليج عدن اجتماعات منتظمة للمجلس ويقدم تحديثات مرحلية، وتنفيذ مبادرات متبادلة تعزز التعاون، والحفاظ على حوار قوي بين الممثلين الأعضاء، ووضع سياسات تفيد جميع الأعضاء بشكل متبادل. التعاون أمر بالغ الأهمية للمجلس، ويقدرمجلس منظمة البحر الأحمر وخليج عدن الشراكات مع الكتل والمنظمات من جميع أنحاء العالم. إن المجتمع الدولي التعاوني يسمح للعالم بأسره بالتطور والتعلم والازدهار. لذلك، سيعمل مجلس منظمة البحر الأحمر وخليج عدن مع المنظمات والتكتلات واللجان الإقليمية والدولية من جميع أنحاء العالم.
            
            المجلس الأعلى هو أعلى سلطة في مجلس منظمة البحر الأحمر وخليج عدن ويتألف من ملوك ورؤساء الدول الأعضاء في المجلس. وسيترأس المجلس الأعلى بالتناوب لكل فترة حسب الترتيب الأبجدي لأسماء الدول الأعضاء. غير أن البلد المضيف يرأس المجلس لفترة الولاية الأولى كاستثناء. وسيجتمع المجلس الأعلى بانتظام مرة في السنة، وله أن يعقد اجتماعات استثنائية عند الاقتضاء. ستكون الاجتماعات صالحة إذا حضر ثلثا أعضاء المجلس.
            `,
            brief3: `العلاقات بين أعضاء المجموعة، أو الشبكة الاجتماعية داخل المجموعة، ضرورية لنجاح أي منظمة. يهدف مجلس النهوض بالنمو الاستراتيجي الإقليمي ( مجلس منظمة البحر الأحمر وخليج عدن) إلى تعزيز العلاقات بين أعضائه من خلال مبادرات مختلفة. يعتزم المجلس زيادة التعاون في جميع المجالات بين الدول الأعضاء، ووضع أجندات متماسكة، والعمل نحو أهداف مشتركة، وتحقيق النمو المتبادل في جميع أنحاء المجلس.

            يلتزم  مجلس منظمة البحر الأحمر وخليج عدن ليس فقط بزيادة التعاون من خلال مجالات تركيزه الرئيسية ولكن أيضًا لتحفيز النمو بين الأعضاء. يمكن تحقيق ذلك من خلال عقد اجتماعات منتظمة للمجلس وتحديث التقدم، والشروع في مبادرات متبادلة تعزز التعاون، والحفاظ على حوار قوي بين الممثلين الأعضاء، وتنفيذ سياسات تفيد جميع الأعضاء بشكل متبادل.
            
            التعاون أمر بالغ الأهمية لنجاح المجلس، ويقدر  مجلس منظمة البحر الأحمر وخليج عدن الشراكات مع الكتل والمنظمات من جميع أنحاء العالم. إن المجتمع الدولي التعاوني يسمح للعالم بأسره بالتطور والتعلم والازدهار. سيعمل  مجلس منظمة البحر الأحمر وخليج عدن مع المنظمات والتكتلات واللجان الإقليمية والدولية من جميع أنحاء العالم لتحقيق هذا الهدف.
            
            المجلس الأعلى هو أعلى سلطة في المجلس ويتألف من ملوك ورؤساء الدول الأعضاء. ويتولى رئاسة المجلس الأعلى بالتناوب لكل ولاية وفقا للترتيب الأبجدي لأسماء الدول الأعضاء. وكاستثناء، يرأس البلد المضيف المجلس لفترة الولاية الأولى. يجتمع المجلس الأعلى بانتظام مرة في السنة ويجوز له عقد اجتماعات استثنائية عند الاقتضاء. وتكون الجلسات صحيحة إذا حضرها ثلثا أعضاء المجلس.
            `,
        },
        explore: "إستكشف أكثر",
        copyright: "جميع حقوق النشر محفوظة © 2023",
        focus: {
            economicDevelopmentHeading: `
            التنمية الاقتصادية في المستقبل
            `,
            economicDevelopmentTitle: `تغيير التصورات والأفكار`,
            economicDevelopmentDescription: `ما هي تحديدًا التنمية الاقتصادية وكيف تطور المفهوم على مر السنين ؟ وفي حين أن الجانب الاقتصادي قد يبدو بسيطًا نسبيًا فإن الارتفاع المطرد في دخل الفرد ليس سوى جزء واحد من المعادلة. ولا يكفي ضمان التنمية أو النمو الاقتصادي بمفرده.
            كما أن توزيع هذا الدخل المتزايد بين السكان جانب أساسي من جوانب التنمية الاقتصادية. فالتفاوت في الدخل والفقر عاملان حاسمان يجب مراعاتهما. وإذا زاد متوسط الدخل، ولكن التفاوت في توزيعه يزداد أيضا، عندئذ يمكن اعتبار التنمية الاقتصادية نتيجة سلبية من منظور المساواة. وبالمثل، إذا زاد الفقر وانخفض عدد السكان إلى ما دون مستويات الدخل المقبولة اجتماعيا، فإن ذلك يمثل علامة سلبية أخرى يجب تحديدها مقابل ارتفاع متوسط الدخل عند تقييم التنمية الاقتصادية. وسواء انخفض الفقر بالفعل أم لا، فإن ذلك سيتوقف على التفاعل بين متوسط الدخل وعدم المساواة، وأي من القوتين يهيمن من الناحية التجريبية.
            
            التركيز فقط على دخل السوق المقاس يفقد الموارد القيمة التي لا يتم تسعيرها بشكل مناسب في السوق، مثل البيئة. إن ارتفاع الدخل القومي كما تم قياسه تقليديًا لا يأخذ في الاعتبار فقدان الموارد البيئية التي لا يمكن الاستغناء عنها على المستوى الوطني أو التأثير الذي لا رجعة فيه على الكوكب بسبب تغير المناخ.
            
            وفي الختام، لا تتعلق التنمية الاقتصادية بارتفاع مستويات الدخل فحسب، بل أيضا بكيفية توزيع الدخل وتأثير التنمية على البيئة. ولذلك، من الضروري توسيع نطاق منظورنا والنظر في اتباع نهج أكثر شمولا لقياس التنمية الاقتصادية في المستقبل.
            `,


            scienceTechnologyHeading: `العلوم والتكنولوجيا في المستقبل`,
            scienceTechnologyTitle: `تغيير النظرة لغدٍ أفضل`,
            scienceTechnologyDescription: `جلب البحث العلمي العديد من الفوائد، ولا سيما في مجال الطب، حيث يتم تطوير مفاهيم وأساليب علاجية وتجارب دوائية جديدة باستمرار، مما ينقذ الآلاف من الأرواح كل عام. إن إمكانيات البحث المستقبلي هائلة، وتوفر علاجات محتملة للأمراض ورعاية محسنة للمرضى لملايين الأشخاص.

            وضع خطة العلوم والتكنولوجيا الأساسية الثالثة في مارس 2006 أولوية لتطوير الإجراءات العلمية والتكنولوجية التي تعود بالفائدة على المجتمع، وتعزز الموارد البشرية، وتعزز بيئة تنافسية تدعمها الجمهور. وتهدف الخطة إلى معالجة المشكلات البيئية العالمية والتغييرات الاجتماعية الناجمة عن شيخوخة السكان وانخفاض عدد الأطفال، وستنفذ تقييمات الأولويات الاستراتيجية وإصلاحات النظام ومبادرات لتحسين فهم الجمهور للعلوم والتكنولوجيا. ومن المتوقع أن تسهم العلوم والتكنولوجيا بشكل كبير في المجتمع، وتضمن النمو الاقتصادي المستقر وحماية صحة وسلامة المواطنين في حياتهم اليومية في ظل هذه التغييرات الديموغرافية.
            `,


            environmentHeading: `
            الاستدامة البيئية في المستقبل`,
            environmentTitle: `تغيير تصور البيئة في المستقبل            `,
            environmentDescription: `
            تعتبر الالتزامات الأساسية لمجموعة توشيبا "ملتزمون بالناس، ملتزمون بالمستقبل"، والتي تعبر عن التفاني الثابت للشركة في المساهمة في تنمية المجتمع من خلال أعمالها. منذ تأسيسها، تهدف توشيبا إلى دمج قوة الاختراع مع خبرتها لمواجهة المسائل الاجتماعية المعقدة المتزايدة وخلق عالم أفضل. وفي إطار خطتها التجارية المتوسطة الأجل، ستوفر توشيبا خدمات فريدة تعتمد على تقنيات موثوقة ومتطورة للمساعدة في حل المسائل الاجتماعية والمساهمة في تحقيق أهداف التنمية المستدامة وتعزيز قيمتها الشركاتية. تعتبر مبادرات توشيبا في البيئة من أولوياتها العليا في إدارة الشركات وستعمل على تعزيز هذه المبادرات بشكل وثيق مرتبطة بخطة الأعمال في المجموعة.

في السنوات الأخيرة، تزايدت العديد من المشكلات البيئية مثل التغير المناخي، ونفاد الطاقة والموارد، وتهديد الأجيال القادمة بحياة آمنة ومستقرة. وقد أسرعت اعتماد اتفاقية باريس في عام 2015 حركة التوجه نحو الحياد الكربوني في كل بلد. لذلك يجب على الشركات أن تدرك أهمية التغير المناخي من منظور طويل الأجل والاستجابة بشكل نشط لتحقيق الحياد الكربوني. كما تحاول الدول في جميع أنحاء العالم معالجة القضايا مثل الانتقال إلى اقتصاد دائري والبلاستيك البحري وموارد المياه وحفظ التنوع البيولوجي. نتيجة لذلك، فإن اهتمام المجتمع بمثل هذه القضايا في ازدياد. في الوقت نفسه، يكتسب نشاط الأهداف التنموية المستدامة، وتوسيع الاستثمارات المستدامة، والحركات الأخرى المتعلقة بإدارة الشركات المستهدفة للإستدامة بشكل عام معززين الزخم.
            `,


            tradeHeading: "التجارة في المستقبل: تغيير الاتجاهات",
            tradeTitle: "تغيير تصور التجارة في المستقبل",
            tradeDescription: `نمط التكامل الاقتصادي الحالي والانفصال في مختلف الاقتصاديات والقطاعات يصف بأفضل صورة بـ "إعادة العولمة". على الرغم من أن العولمة لم تنته بعد، إلا أنها تتغير في طبيعتها من خلال التركيز على روابط إقليمية أقوى بين البلدان وتشكيل كتل اقتصادية للقطاعات الحساسة والاستراتيجية. لا يمكن تحقيق فصل كامل من الصين، ولا يرغب الدول الكبرى في ذلك. للسياسة التجارية دور مهم في تعزيز الجوانب الإيجابية للعالم الذي يعيد التكامل وتحقيق التوازن بين المنافسة والتعاون الجيوسياسي. يمكن تحقيق ذلك ليس فقط من خلال جهود منسقة لتعزيز مرونة سلاسل الإمداد، ولكن أيضًا من خلال تمكين الدول في جميع أنحاء العالم من الاستفادة من الانتقالات المزدوجة إلى الاقتصادات الخضراء والرقمية. يستند هذا الورق الموجز على نتائج المناقشات المختصة وسلسلة من المتحدثين الرفيعي المستوى في إطار منتدى سياسة التجارة العالمي لمؤسسة تشاتهام هاوس.`,


            politicalStanceHeading: "التوجهات السياسية في المستقبل",
            politicalStanceTitle: "تغيرات في التصورات الخاصة بالسياسة",
            politicalStanceDescription: `كان هناك رأي متداول منذ فترة طويلة في بعض الدوائر المحافظة في الغرب بأن الأحزاب السياسية في انحدار، حيث ينظر إليها على أنها قوة مثيرة للفتنة بين المواطنين وتهدد الوحدة الوطنية. في بعض الدول الأوروبية، مثل فرنسا، رفضت المنظمات السياسية اليمينية حتى تسمية نفسها أحزابًا، بدلاً من ذلك استخدمت مصطلحات مثل الحركة والاتحاد والاتحاد والمركز. على الرغم من أنه من الصحيح أن الأحزاب السياسية المعاصرة الأوروبية والأمريكية تبدو قديمة وصلبة بالمقارنة مع حالتها في بداية القرن أو فور الحرب العالمية الأولى، لا يمكن إنكار أن الأحزاب السياسية تنمو في الحجم والعدد.
            في بداية القرن العشرين، كانت الأحزاب السياسية مقتصرة بشكل رئيسي على أوروبا وأمريكا الشمالية، وكانت ضعيفة أو غير موجودة في أماكن أخرى. وفي بداية القرن الحادي والعشرين، أصبحت الأحزاب موجودة في جميع أنحاء العالم. في أوروبا وأمريكا الشمالية، كان هناك عدد أكبر بكثير من الأشخاص الذين يحملون عضوية في الأحزاب مقارنة بالفترة قبل عام 1914. كانت الأحزاب في بداية القرن الحادي والعشرين أكبر حجماً وأقوى وأكثر تنظيماً من تلك في نهاية القرن التاسع عشر. على الرغم من أن الأحزاب في البلدان الصناعية، وخاصة في غرب أوروبا، أصبحت أقل ثورية ومبتكرة، إلا أن هذا العامل قد يشرح الصورة القاسية 
            والتي يبدو عليها الأحزاب بشكلٍ متيبس. ومع ذلك، يتم العثور على هذه الظاهرة في منطقة محدودة وربما تمر.
            في المستقبل، من الممكن أن تستمر الأحزاب السياسية في التطور والتكيف مع التغيرات المتغيرة. سيحتاجون إلى معالجة مخاوف سكان متنوعين ويزدادون عالمياً، بينما يتم موازنة الحاجة إلى الاستقرار والاستمرارية مع الطلب على الابتكار والتقدم. سيظل دور الأحزاب السياسية في صياغة السياسات العامة وتمثيل مصالح ممثليهم حاسماً، حتى وإن تغير المناظر السياسية وظهرت تحديات جديدة.
            `,


            securityHeading: "الأمن في المستقبل",
            securityTitle: "تغيير الإدراك حول الأمن في المستقبل",
            securityDescription: `يتشكل مستقبل الأمن السيبراني بسبب الحاجة المتزايدة للشركات لتأمين شبكاتها وبياناتها وأجهزتها وهوياتها. يمكن أن تساعد إطارات الأمان مثل الثقة الصفرية في تأمين الأنظمة والبيانات الداخلية في السحابة. ومع ظهور التهديدات الجديدة باستمرار، أصبحت المناظر الأمنية أكثر تعقيدًا من أي وقت مضى. وقد أدى انتشار الفدية إلى جعل المؤسسات أكثر وعيًا بقدرتها على الانتعاش من الهجمات، ولكن تستمر الحاجة إلى الأمان في التطور مع تطور التقنيات والتطبيقات والأجهزة بمعدل لم يسبق له مثيل. لذلك، يجب على المؤسسات البقاء مركزة على الحلول التي تسمح لها بالبقاء على آخر مستجدات التكنولوجيا والأعمال.
            مستقبل الأمان السيبراني شاسع. مع تزايد التقنيات الرقمية وتحديثها، أصبح الأمن السيبراني ضروريًا للشركات والحكومات والمستهلكين والجميع تقريبًا. إن اعتماد الأجهزة النقالة وخدمات السحابة والتقنيات الذكية المختلفة يحمل في طياته تهديدات ومخاطر جديدة. لذلك، يلعب الأمن السيبراني دورًا حاسمًا في حماية الشبكات الحاسوبية من الوصول غير المصرح به، بما في ذلك أنظمة أمان الشبكات ومراقبة الشبكة وتخزين البيانات وحمايتها. يهدف إلى ضمان حماية البيانات من الوصول غير المصرح به من قِبَل القراصنة والتهديدات الأخرى. ومن بين المشاكل الشائعة في الأمن السيبراني: العدوى بالبرامج الضارة، والثغرات في الشبكات، وانتهاكات البيانات.
            للأمن السيبراني جانب اجتماعي، حيث يتضمن فهم كيف يؤثر تصرف الفرد على غيره في المنظمة وبناء خط اتصال مفتوح بين الموظفين. لا يمكن التشديد كثيرًا على أهمية الأمن السيبراني. فمن الضروري أن تتخذ المؤسسات إجراءات لحماية أصول المعلومات الخاصة بها من الهجمات أو التسريبات المحتملة، سواء في العالم الفيزيائي أو العالم الرقمي.
            `,


            maritimeHeading: "الشؤون البحرية في المستقبل",
            maritimeTitle: "تغيير مفهوم الشؤون البحرية في المستقبل",
            maritimeDescription: `شؤون الشحن البحري تتعرض عادة لانتقادات بسبب دورها في التلوث البيئي والانبعاثات، وهو أمر لا يُفاجئنا بالنظر إلى أنها تحمل أكثر من 90% من التجارة العالمية. السفن الضخمة، التي يعمل معظمها بالوقود الأحفوري، لا تُعدُّ بيئيّة على الإطلاق. لكن الصناعة تقترب من نقطة تحول في تفكيرها، حيث بدأت الشركات الرئيسية في المشاريع "الخضراء"، وطلبت سفنًا جديدة مزودة بتقنيات الوقود المزدوجة أو حتى صفر الانبعاثات. لنلقي نظرة على أحدث المبادرات والنجاحات.

            تخطط شركة Van Dam Shipping، بالتعاون مع شركة Tata Steel الهندية، لإطلاق سفينة تعمل بالهيدروجين بحلول عام 2024، والتي ستكون خالية تمامًا من ثاني أكسيد الكربون وستوفر حوالي 3000 طن من ثاني أكسيد الكربون سنويًا مقارنة بالسفن التي تعمل بالوقود الأحفوري.
            
            مع هذه المشاريع والإنجازات، فإن صناعة النقل البحري تتجه بلا شك نحو مستقبل أكثر خضرة. لمناقشة هذه المبادرات، والأفكار الجديدة، والتحديات، ومشاركة الممارسات الجيدة، ينظم خبير شبكات النقل البحري IGGS Group تجمعًا استثنائيًا في روتردام - منتدى Envirotech الثاني للشحن في 5 و6 أكتوبر. إذا كنت ترغب في توسيع معرفتك أو لقاء عملاء حاليين أو محتملين، فانقر على الرابط أدناه لمزيد من المعلومات حول هذا التجمع.
            `,


            naturalResourcesHeading: "الموارد الطبيعية في المستقبل",
            naturalResourcesTitle: "تغيير الإدراك للموارد الطبيعية",
            naturalResourcesDescription: `تشير الموارد الطبيعية إلى تلك الموارد التي تحدث في شكلها الأصلي والطبيعي داخل البيئة، دون أي تدخل من الإنسان. وهي تستغرق سنوات للتكوين وتعتبر حيوية لبقائنا على قيد الحياة. فالأرض الأم هي مليئة بالموارد الطبيعية التي تتطور على هذا الكوكب باستخدام البيئة المحيطة به. وبينما تستخدم بعض الموارد مثل الماء والهواء للبقاء على قيد الحياة، يستخدم الآخرون مثل الفحم والغاز والنفط لتلبية احتياجاتنا اليومية.

            ومع اقتراب عدد سكان العالم من 8 مليارات نسمة، أصبح إدارة الموارد مصدر قلق كبير. وبينما تعد الحفاظ على الموارد أمراً حيوياً، فإنه من المهم بالمثل فهم أنه مع نمو السكان، ستزداد الطلب على الموارد. ويزيد تصنيع الدول النامية هذه المشكلة بشكل أكبر.
            
            مع نمو المجتمعات وتحولها إلى أكثر تحضرًا، يزداد استهلاكها للموارد الطبيعية. تخطيط زيادة الطلب أمر حاسم، ويجب علينا السعي لإيجاد حلول مستدامة.
            
            يوجد نوعان من الموارد الطبيعية بناءً على مرحلة تطورها:
            
            الموارد المحتملة: هذه الموارد لم تستخدم بعد ولكن لديها القدرة على الاستفادة منها في المستقبل. على سبيل المثال، يعد البترول في الصخور الرسوبية موردًا محتملاً حتى يتم حفره ووضعه في الاستخدام.
            
            الموارد الفعلية: هذه هي الموارد التي تم تحقيقها وتم تحديد كميتها وجودتها وهي في الاستخدام حاليًا. وأمثلة على ذلك تتضمن معالجة الخشب التي تعتمد على التكنولوجيا والتكلفة.
            
            وفي الخلاصة، من المهم الاعتراف بأهمية الموارد الطبيعية وإدارتها. ونحن نسعى لتلبية احتياجات سكان متزايدة، يجب السعي لإيجاد طرق مستدامة للاستفادة من هذه الموارد وحفظها للأجيال المقبلة.
            `,
        }
    },
};
const header__home = document.querySelectorAll('.header__home');
const header__member = document.querySelectorAll('.header__member');
const header__aboutUs = document.querySelectorAll('.header__aboutUs');
const header__services = document.querySelectorAll('.header__services');
const header__focus = document.querySelectorAll('.header__focus');
const header__collaboration = document.querySelectorAll('.header__collaboration');
const header__contactUs = document.querySelectorAll('.header__contactUs');
const arrow = document.querySelectorAll('.fa-arrow-right')
const exploreMore = document.querySelectorAll('.exploreMore');
const hiddenElements = document.querySelectorAll('.scrollAnimat');
hiddenElements.forEach((el) => observer.observe(el));

window.addEventListener('load', () => {
    document.getElementById('pageLoader').style.display = "none";
    document.body.style.overflowX = 'hidden';
    document.body.style.overflowY = 'auto';

    if (sessionStorage.getItem('lang') == "ar") {
        document.body.classList.add('rtlDir');
        header__home.forEach(element => {
            element.textContent = language.ar.header.home;
        });
        header__member.forEach(element => {
            element.textContent = language.ar.header.members;
        });
        header__aboutUs.forEach(element => {
            element.textContent = language.ar.header.aboutUs;
        });
        header__services.forEach(element => {
            element.textContent = language.ar.header.services;
        });
        header__focus.forEach(element => {
            element.textContent = language.ar.header.focus;
        });
        header__collaboration.forEach(element => {
            element.textContent = language.ar.header.collaboration;
        });
        header__contactUs.forEach(element => {
            element.textContent = language.ar.header.contactUs;
        });
        arrow.forEach(element => {
            element.classList.replace('fa-arrow-right', 'fa-arrow-left');
        });
        exploreMore.forEach(element => {
            element.textContent = language.ar.explore;
        });
        // Home page
        if (document.getElementById('home__heading')) {
            document.getElementById('home__heading').textContent = language.ar.mainHeading.home;
            document.getElementById('member__title').textContent = language.ar.mainHeading.focus;
            document.getElementById('main__authority__title').textContent = language.ar.homePage.authorityDiv.authorityTitle;
            document.getElementById('main__authority__brief').textContent = language.ar.homePage.authorityDiv.authorityBrief;
            document.getElementById('main__collaboration__title').textContent = language.ar.homePage.collaborationTitle;
            document.getElementById('main__collaboration__subTitle').textContent = language.ar.homePage.collaborationDiv.title;
            document.getElementById('main__collaboration__brief').textContent = language.ar.homePage.collaborationDiv.brief;

            document.getElementById('copyright').textContent = language.ar.copyright;
            document.getElementById('focus').textContent = language.ar.aboutUs.focus;
            document.getElementById('environment').textContent = language.ar.aboutUs.environment;
            document.getElementById('economicDevelopment').textContent = language.ar.aboutUs.economicDevelopment;
            document.getElementById('scienceTechnology').textContent = language.ar.aboutUs.scienceTechnology;
            document.getElementById('trade').textContent = language.ar.aboutUs.trade;
            document.getElementById('politicalStance').textContent = language.ar.aboutUs.politicalStance;
            document.getElementById('security').textContent = language.ar.aboutUs.security;
            document.getElementById('naturalResources').textContent = language.ar.aboutUs.naturalResources;
            document.getElementById('maritime').textContent = language.ar.aboutUs.maritime;
            document.getElementById('whoWeAre').textContent = language.ar.aboutUs.whoWeAre;
            document.getElementById('brief').textContent = language.ar.aboutUs.brief;
            document.getElementById('haveQuestion').textContent = language.ar.contactUs.haveQuestion;
            document.getElementById('fillUp').textContent = language.ar.contactUs.fillUp;
            document.getElementById('firstname').placeholder = language.ar.contactUs.firstName;
            document.getElementById('lastname').placeholder = language.ar.contactUs.lastName;
            document.getElementById('email').placeholder = language.ar.contactUs.email;
            document.getElementById('message').placeholder = language.ar.contactUs.message;
            document.getElementById('submit').textContent = language.ar.contactUs.submit;

            document.getElementById('egypt__name').textContent = language.ar.memberPage.countries.egypt.name;
            document.getElementById('jordan__name').textContent = language.ar.memberPage.countries.jordan.name;
            document.getElementById('saudi__name').textContent = language.ar.memberPage.countries.saudi.name;
            document.getElementById('djibouti__name').textContent = language.ar.memberPage.countries.djibouti.name;
            document.getElementById('somalia__name').textContent = language.ar.memberPage.countries.somalia.name;
            document.getElementById('sudan__name').textContent = language.ar.memberPage.countries.sudan.name;
            document.getElementById('yemen__name').textContent = language.ar.memberPage.countries.yemen.name;
            document.getElementById('eriteria__name').textContent = language.ar.memberPage.countries.eriteria.name;

            document.getElementById('egypt__short__brief').textContent = language.ar.memberPage.countries.egypt.shortBrief;
            document.getElementById('saudi__short__brief').textContent = language.ar.memberPage.countries.saudi.shortBrief;
            document.getElementById('jordan__short__brief').textContent = language.ar.memberPage.countries.jordan.shortBrief;
            document.getElementById('somalia__short__brief').textContent = language.ar.memberPage.countries.somalia.shortBrief;
            document.getElementById('yemen__short__brief').textContent = language.ar.memberPage.countries.yemen.shortBrief;
            document.getElementById('sudan__short__brief').textContent = language.ar.memberPage.countries.sudan.shortBrief;
            document.getElementById('eriteria__short__brief').textContent = language.ar.memberPage.countries.eriteria.shortBrief;
            document.getElementById('djibouti__short__brief').textContent = language.ar.memberPage.countries.djibouti.shortBrief;
        }
        // RSGA members
        if (document.getElementById('somalia__description')) {
            document.getElementById('somalia__description').textContent = language.ar.memberPage.countries.somalia.brief;
            document.getElementById('somalia__name').textContent = language.ar.memberPage.countries.somalia.name;
            document.getElementById('aboutState').textContent = language.ar.memberPage.aboutState;
        }

        if (document.getElementById('sudan__description')) {
            document.getElementById('sudan__description').textContent = language.ar.memberPage.countries.sudan.brief;
            document.getElementById('sudan__name').textContent = language.ar.memberPage.countries.sudan.name;
            document.getElementById('aboutState').textContent = language.ar.memberPage.aboutState;
        }

        if (document.getElementById('jordan__description')) {
            document.getElementById('jordan__description').textContent = language.ar.memberPage.countries.jordan.brief;
            document.getElementById('jordan__name').textContent = language.ar.memberPage.countries.jordan.name;
            document.getElementById('aboutState').textContent = language.ar.memberPage.aboutState;
        }

        if (document.getElementById('saudi__description')) {
            document.getElementById('saudi__description').textContent = language.ar.memberPage.countries.saudi.brief;
            document.getElementById('saudi__name').textContent = language.ar.memberPage.countries.saudi.name;
            document.getElementById('aboutState').textContent = language.ar.memberPage.aboutState;
        }

        if (document.getElementById('egypt__description')) {
            document.getElementById('egypt__description').textContent = language.ar.memberPage.countries.egypt.brief;
            document.getElementById('egypt__name').textContent = language.ar.memberPage.countries.egypt.name;
            document.getElementById('aboutState').textContent = language.ar.memberPage.aboutState;
        }

        if (document.getElementById('yemen__description')) {
            document.getElementById('yemen__description').textContent = language.ar.memberPage.countries.yemen.brief;
            document.getElementById('yemen__name').textContent = language.ar.memberPage.countries.yemen.name;
            document.getElementById('aboutState').textContent = language.ar.memberPage.aboutState;
        }

        if (document.getElementById('djibouti__description')) {
            document.getElementById('djibouti__description').textContent = language.ar.memberPage.countries.djibouti.brief;
            document.getElementById('djibouti__name').textContent = language.ar.memberPage.countries.djibouti.name;
            document.getElementById('aboutState').textContent = language.ar.memberPage.aboutState;
        }

        if (document.getElementById('eriteria__description')) {
            document.getElementById('eriteria__description').textContent = language.ar.memberPage.countries.eriteria.brief;
            document.getElementById('eriteria__name').textContent = language.ar.memberPage.countries.eriteria.name;
            document.getElementById('aboutState').textContent = language.ar.memberPage.aboutState;
        }
        // Focus members
        if (document.getElementById('economic__description')) {
            document.getElementById('economic__description').textContent = language.ar.focus.economicDevelopmentDescription;
            document.getElementById('economic__title').textContent = language.ar.focus.economicDevelopmentTitle;
            document.getElementById('economic__heading').textContent = language.ar.focus.economicDevelopmentHeading;
        }
        
        if (document.getElementById('environment__description')) {
            document.getElementById('environment__description').textContent = language.ar.focus.environmentDescription;
            document.getElementById('environment__title').textContent = language.ar.focus.economicDevelopmentTitle;
            document.getElementById('environment__heading').textContent = language.ar.focus.environmentHeading;
        }

        if (document.getElementById('maritime__description')) {
            document.getElementById('maritime__description').textContent = language.ar.focus.maritimeDescription;
            document.getElementById('maritime__title').textContent = language.ar.focus.maritimeTitle;
            document.getElementById('maritime__heading').textContent = language.ar.focus.maritimeHeading;
        }

        if (document.getElementById('natural__description')) {
            document.getElementById('natural__description').textContent = language.ar.focus.naturalResourcesDescription;
            document.getElementById('natural__title').textContent = language.ar.focus.naturalResourcesTitle;
            document.getElementById('natural__heading').textContent = language.ar.focus.naturalResourcesHeading;
        }

        if (document.getElementById('political__description')) {
            document.getElementById('political__description').textContent = language.ar.focus.politicalStanceDescription;
            document.getElementById('political__title').textContent = language.ar.focus.politicalStanceTitle;
            document.getElementById('political__heading').textContent = language.ar.focus.politicalStanceHeading;
        }

        if (document.getElementById('science__description')) {
            document.getElementById('science__description').textContent = language.ar.focus.scienceTechnologyDescription;
            document.getElementById('science__title').textContent = language.ar.focus.scienceTechnologyTitle;
            document.getElementById('science__heading').textContent = language.ar.focus.scienceTechnologyHeading;
        }

        if (document.getElementById('security__description')) {
            document.getElementById('security__description').textContent = language.ar.focus.securityDescription;
            document.getElementById('security__title').textContent = language.ar.focus.securityTitle;
            document.getElementById('security__heading').textContent = language.ar.focus.securityHeading;
        }

        if (document.getElementById('trade__description')) {
            document.getElementById('trade__description').textContent = language.ar.focus.tradeDescription;
            document.getElementById('trade__title').textContent = language.ar.focus.tradeTitle;
            document.getElementById('trade__heading').textContent = language.ar.focus.tradeHeading;
        }

    } else {
        document.body.classList.remove('rtlDir');
        arrow.forEach(element => {
            element.classList.replace('fa-arrow-left', 'fa-arrow-right');
        });
    }
})